Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Although `@DefaultBean` is the recommended approach, it is also possible for application code to override beans provided by an extension by marking beans as a CDI `@Alternative` and including `@Priority` annotation. Let's show a simple example. Suppose we work on an imaginary "quarkus-parser" extension and we have a default bean implementation:
ja_jp: `@DefaultBean` が推奨されていますが、CDI `@Alternative` としてBeanをマークし、 `@Priority` アノテーションを含めることで、アプリケーションコードがエクステンションによって提供されるBeanをオーバーライドすることも可能です。簡単な例を示しましょう。架空の"quarkus-parser"エクステンションで作業をしていて、デフォルトのBeanの実装を持っているとします。

source: Although `@NativeImageTest` is not yet deprecated, it will be in the future as its functionality is covered by `@QuarkusIntegrationTest` which is described in the following section.
ja_jp: `@NativeImageTest` はまだ非推奨ではありませんが、その機能は次のセクションで説明する `@QuarkusIntegrationTest` でカバーされるため、将来的には非推奨になるでしょう。

source: Although focused on microservices, Quarkus is also perfectly suited for large monoliths, whether you are migrating existing applications to a more modern runtime or building new ones from scratch. Quarkus has always been able to handle large applications, but we have recently made significant improvements in this area, particularly when it comes to build times. Read "Towards faster builds" by Guillaume Smet to learn more about these improvements. Read "Implementing an arXiv MCP Server with Quarkus in Java" by Guillaume Laforge to learn about building an MCP server to access the arXiv research paper website where pre-print versions are published and shared with the community. The author's goal was to shed light on some lesser-known aspects of the Model Context Protocol, tools, resources and prompts. Learn the details of why Anand Jaisy chose to switch frameworks in "Micronaut vs Quarkus: Why I Switched After Two Years". Check out "How to Trace Quarkus Reactive Messaging with OpenTelemetry" by Nawaz Dhandala to learn how to implement distributed tracing for Quarkus Reactive Messaging applications using OpenTelemetry to track messages across Kafka and other messaging systems. Make sure you try this realistic Java walkthrough showing validation, retries, idempotency, and Kafka-backed workflows with Quarkus in "Your Second Reactive Messaging App: What Production Systems Actually Need" by Markus Eisele. Then you can learn about using graph-based analysis to detect and prevent architectural decay in Java applications in his second blog post, "Your Quarkus Architecture Is Drifting. JQAssistant Can Prove It."
ja_jp: Quarkusはマイクロサービスに重点を置いていますが、既存のアプリケーションをよりモダンなランタイムに移行する場合でも、新しいアプリケーションをゼロから構築する場合でも、大規模なモノリスにも完全に適しています。Quarkusは常に大規模なアプリケーションを処理できましたが、特にビルド時間に関しては、この分野で最近大幅な改善を行いました。これらの改善の詳細については、Guillaume Smetによる「Towards faster builds (より高速なビルドに向けて)」をお読みください。Guillaume Laforgeによる「Implementing an arXiv MCP Server with Quarkus in Java (QuarkusとJavaでarXiv MCPサーバーを実装する)」を読んで、事前公開版がコミュニティと共有されるarXiv研究論文ウェブサイトにアクセスするためのMCPサーバーの構築について学びましょう。著者の目標は、Model Context Protocolのあまり知られていない側面、ツール、リソース、プロンプトに光を当てることでした。Anand Jaisyが「Micronaut vs Quarkus: Why I Switched After Two Years (Micronaut vs Quarkus: 2年後にフレームワークを切り替えた理由)」でフレームワークを切り替えることを選んだ理由の詳細を学びましょう。Nawaz Dhandalaによる「How to Trace Quarkus Reactive Messaging with OpenTelemetry (OpenTelemetryでQuarkus Reactive Messagingをトレースする方法)」をチェックして、OpenTelemetryを使用してKafkaやその他のメッセージングシステム間でメッセージを追跡するためのQuarkus Reactive Messagingアプリケーションの分散トレースを実装する方法を学びましょう。Markus Eiseleによる「Your Second Reactive Messaging App: What Production Systems Actually Need (あなたの2番目のリアクティブメッセージングアプリ: 生産システムが実際に必要とするもの)」で、バリデーション、再試行、冪等性、Kafkaを活用したワークフローをQuarkusで示すこの実践的なJavaウォークスルーをぜひ試してみてください。次に、彼の2番目のブログ投稿「Your Quarkus Architecture Is Drifting. JQAssistant Can Prove It. (あなたのQuarkusアーキテクチャは漂流している。JQAssistantがそれを証明できる。)」で、グラフベースの分析を使用してJavaアプリケーションのアーキテクチャの劣化を検出および防止する方法について学ぶことができます。

source: Although it is possible to remote debug processes within containers, it might be easier to step-by-step debug native-image by installing Mandrel locally and adding it to the path of the shell process.
ja_jp: コンテナ内のプロセスをリモートデバッグすることは可能ですが、Mandrelをローカルにインストールしてシェルプロセスのパスに追加することで、native-imageをステップバイステップでデバッグする方が簡単かもしれません。

source: Although not directly useful to users in most cases, the new Language Server console view is extremely important when we need to troubleshoot issues with the language servers.
ja_jp: ほとんどの場合、ユーザーには直接役立ちませんが、新しい言語サーバーのコンソールビューは、言語サーバーの問題をトラブルシューティングする必要がある場合に非常に重要です。

source: Although that video and related papers and articles date all back to 2015 then even today you will find tools that fall short with the coordinated oission problem
ja_jp: そのビデオと関連する論文や記事の日付はすべて2015年にさかのぼりますが、現在でも、協調的省略の問題で不十分なツールを見つけることができます。

source: Although the absolute highest throughput is achieved when an endpoint method is non-blocking (that is the HTTP request is served completely from the event loop thread), great performance can nonetheless be achieved even when `@Blocking` is used.
ja_jp: エンドポイントメソッドがノンブロッキング (つまり、HTTP リクエストがイベントループスレッドから完全に提供される) の場合には、絶対的に最高のスループットが達成されますが、 `@Blocking` を使用していても優れたパフォーマンスを達成することができます。

source: Although the default for STM object state is volatile, it is possible to configure the STM implementation such that an object's state is durable. Although it's possible to configure Narayana such that different backend datastores can be used, including relational databases, the default is the local operating system file system, which means you don't need to configure anything else with Quarkus such as a database.
ja_jp: STMオ ブジェクトステートのデフォルトは揮発性ですが、オブジェクトの状態が耐久性を持つように STM の実装を構成することができます。リレーショナルデータベースなど、さまざまなバックエンドのデータストアを使用できるように Narayana を設定することは可能です。ただし、デフォルトはローカルのオペレーティングシステムのファイルシステムであり、データベースのように、Quarkus で他の何かを設定する必要はありません。

source: Although the new APIs will give a tiny performance advantage over using the old APIs if the use of `@Context` is involved in the latter case, the advantage is negligible and should not worry you unless you are trying to squeeze out every inch of performance you can find. One thing to keep in mind when writing filters with either API, is that using `org.jboss.resteasy.reactive.server.SimpleResourceInfo` instead of `javax.ws.rs.container.ResourceInfo` is advised as the latter results in reflection being performed.
ja_jp: 後者のケースで `@Context` を使用する場合、新しい API は古い API を使用するよりもわずかなパフォーマンスの優位性を与えます。ただし、その優位性は取るに足らない程度で、可能な限りのパフォーマンスを限界まで引き出すのでない限り、心配する必要はありません。どちらの API を使ってフィルターを書く場合でも注意すべきことは、 `javax.ws.rs.container.ResourceInfo` の代わりに `org.jboss.resteasy.reactive.server.SimpleResourceInfo` を使うことです。

source: Although the new extensions will be available with the regular _1.11_ release, we are considering doing a `1.11.0.Alpha1` release to make it as easy as possible for you to try out the new extensions and provide early feedback.
ja_jp: 新しいエクステンションは通常の _1.11_ リリースで利用可能になりますが、新しいエクステンションを出来る限り簡単に試せるように、そしてフィードバックを簡単に出来るように、私たちは `1.11.0.Alpha1` リリースを行うことを検討しています。

source: Although the new persistence code seems to be working without errors, how do you know anything is being written to the database?
ja_jp: 新しい永続化コードはエラーなく動作しているように見えますが、 実際にデータベースに書き込まれていることは、どのように確認しますか?

source: Although the root logger's handlers are usually configured directly via `quarkus.log.console`, `quarkus.log.file` and `quarkus.log.syslog`, it can nonetheless have additional named handlers attached to it using the `quarkus.log.handlers` property.
ja_jp: ルートロガーのハンドラは、通常、 `quarkus.log.console` 、 `quarkus.log.file` および `quarkus.log.syslog` によって直接設定されますが、 `quarkus.log.handlers` プロパティを使用して、追加の名前付きハンドラを添付することができます。

source: Although the test above is good for showing the capabilities of `@InjectMock`, it is not a good representation of a real test. In a real test we would most likely configure a mock, but then test a bean that uses the mocked bean. Here is an example:
ja_jp: 上のテストは `@InjectMock` の機能を示す場合に適していますが、実際のテストを上手く表してはいません。実際のテストでは、ほとんどの場合、モックを設定し、モックされた Bean を使用する Bean をテストします。以下に例を示します。

source: Although this module is called "runtime", it must be declared in compile scope.
ja_jp: このモジュールは "ランタイム "と呼ばれていますが、コンパイルスコープで宣言する必要があります。

source: Although this module is called "runtime", it must be declared in the compile scope.
ja_jp: このモジュールは「runtime」と呼ばれていますが、コンパイルスコープで宣言する必要があります。

source: Although, there is a slight limitation: since job configuration is mostly dynamic and only injected on job execution, Quarkus may fail to start due to invalid configuration (can’t find the Job configuration values). In this case, configuration injection points with the @ConfigProperty annotation need to set a default value or use an Optional.
ja_jp: ただし、わずかな制約があります。ジョブ設定はほとんど動的であり、ジョブ実行時にのみ注入されるため、Quarkus は無効な設定（ジョブ設定値が見つからないなど）により起動に失敗する可能性があります。この場合、@ConfigProperty アノテーションを持つ設定注入ポイントは、デフォルト値を設定するか、Optional を使用する必要があります。

source: Always make sure that this build step is only run when in dev mode
ja_jp: このビルド・ステップは、常にdevモードのときだけ実行されるようにしてください。

source: Always make sure that this build step is only run when in local dev mode
ja_jp: このビルドステップは、ローカル開発モードの場合にのみ実行されるように常に確認してください。

source: Always make sure that this build step is only run when in local dev mode.
ja_jp: このビルドステップは、必ずローカル開発モードでのみ実行されるようにしてください。

source: Always make the first sentence meaningful and self-contained as it is included in the summary table.
ja_jp: サマリーテーブルに記載されるので、必ず最初の一文に意味を持たせ、自己完結させましょう。

source: Always only do this in Dev Mode
ja_jp: 必ず開発モードでのみ実行してください。

source: Always pass plain text passwords to `BcryptUtil.bcryptHash()` - never pre-hash them.
ja_jp: 常にプレーンテキストのパスワードを `BcryptUtil.bcryptHash()` に渡してください。事前にハッシュ化しないでください。

source: Always review the suggested script. While Quarkus infers schema changes from your entities, domain‑specific data movements, concurrency considerations, and advanced index strategies still require human judgment.
ja_jp: 提案されたスクリプトは必ず確認してください。Quarkus はエンティティーからスキーマの変更を推測しますが、ドメイン固有のデータ移動、並行性の考慮事項、および高度なインデックス戦略には依然として人間の判断が必要です。

source: Always run integration tests when building a native image (test names `*IT` and annotated with `@QuarkusIntegrationTest` or `@NativeImageTest`). + If you do not wish to run integration tests when building a native image, simply remove this property altogether or set its value to `true`.
ja_jp: ネイティブイメージをビルドするときは、常に統合テストを実行します (テスト名は `*IT` で、 `@QuarkusIntegrationTest` または `@NativeImageTest` のアノテーションが付けられています)。+ ネイティブイメージのビルド時に統合テストを実行したくない場合は、このプロパティーを完全に削除するか、その値を `true` に設定します。

source: Always run integration tests when building a native image (test names `*IT` and annotated with `@QuarkusIntegrationTest`). + If you do not wish to run integration tests when building a native image, simply remove this property altogether or set its value to `true`.
ja_jp: ネイティブイメージをビルドする際には、常に統合テストを実行します（テスト名は `*IT` で、アノテーションは `@QuarkusIntegrationTest` ）。+ ネイティブ・イメージのビルド時に統合テストを実行しない場合は、このプロパティを完全に削除するか、その値を `true` に設定してください。

source: Amazon Alexa Integration
ja_jp: Amazon Alexa 統合

source: Amazon Credentials
ja_jp: Amazonクレデンシャル

source: Amazon DynamoDB client
ja_jp: Amazon DynamoDB クライアント

source: Amazon Lambda SnapStart Configuration
ja_jp: Amazon Lambda SnapStartの設定

source: Amazon Lambda with RESTEasy Reactive, Undertow, or Reactive Routes
ja_jp: RESTEasy Reactive、Undertow、または Reactive Routes を使用した Amazon Lambda

source: Amazon Lambda with RESTEasy, Undertow, or Reactive Routes
ja_jp: Amazon Lambda with RESTEasy、もしくはUndertow、Reactive Routes

source: Amazon Lambda with Vert.x Web, Servlet, or RESTEasy
ja_jp: Vert.x WebまたはServlet, RESTEasyを使用したAmazon Lambda

source: Amazon S3 client
ja_jp: Amazon S3 クライアント

source: Amazon Web Services (AWS) announced the SnapStart feature for AWS Lambda. SnapStart reduces startup latency for Java-based functions running on AWS Lambda, and Quarkus supports it from day one!
ja_jp: Amazon Web Services（AWS）は、AWS LambdaのSnapStart機能を発表しました。SnapStartは、AWS Lambda上で動作するJavaベースの関数の起動レイテンシーを削減します。そして、Quarkusは初日からこれをサポートします！

source: Amazon Web Services (AWS) http://aws.amazon.com/blogs/aws/new-accelerate-your-lambda-functions-with-lambda-snapstart[announced] the SnapStart feature for AWS Lambda. SnapStart for Java reduces startup latency for Java-based functions running on AWS Lambda, and Quarkus supports it from day one!
ja_jp: Amazon Web Services（AWS）は、AWS LambdaのSnapStart機能を link:http://aws.amazon.com/blogs/aws/new-accelerate-your-lambda-functions-with-lambda-snapstart[発表] しました。SnapStart for Javaは、AWS Lambda上で動作するJavaベースの関数の起動レイテンシーを削減します。そして、Quarkusは初日からこれをサポートします！

source: Among a lot of bugfixes and small enhancements, the highlights of this release are:
ja_jp: 多くのバグフィックスと小さな機能強化の中で、今回のリリースのハイライトは以下の通りです：

source: Among other fixes and improvements, in this release all methods which "open a session" have been made reactive.
ja_jp: その他の修正・改善点としては、今回のリリースでは、「セッションを開く」全てのメソッドがリアクティブになりました。

source: Among these technical advancements, one of the most pivotal and forward-looking decisions made during the incubation phase was the **adoption of Quarkus** to power Apache Polaris. This strategic shift recognized that a modern Iceberg catalog serving multiple query engines requires more than traditional Java frameworks could efficiently deliver. The team needed a technology stack that could meet the demanding requirements of cloud-native deployments while maintaining the developer productivity essential for rapid innovation.
ja_jp: これらの技術的進歩の中で、インキュベーションフェーズで行われた最も重要かつ将来を見据えた決定の 1 つは、Apache Polaris を強化するための **Quarkus の採用**でした。この戦略的な転換は、複数のクエリエンジンに対応する最新の Iceberg カタログには、従来の Java フレームワークが効率的に提供できる以上のものが必要であることを認識していました。チームは、クラウドネイティブデプロイメントの厳しい要件を満たしつつ、迅速なイノベーションに不可欠な開発者の生産性を維持できる技術スタックを必要としていました。

source: Amount of memory currently used by the allocator
ja_jp: アロケーターによって現在使用されているメモリ量

source: Amount of pinned memory that cannot be reused
ja_jp: 再利用できない固定メモリの量

source: An <<expressions,expression>> outputs an evaluated value. It consists of one or more parts. A part may represent simple properties: `{foo}`, `{item.name}`, and virtual methods: `{item.get(name)}`, `{name ?: 'John'}`. An expression may also start with a namespace: `{inject:colors}`.
ja_jp: <<expressions,expression>> は評価値を出力します。 これは 1つ以上のパーツから構成されます。 パーツは `{foo}`、`{item.name}` のような単純なプロパティーや、`{item.get(name)}`、`{name ?: 'John'}` のような仮想メソッドを表わすことができます。 また、式は名前空間 `{inject:colors}` で始まることもあります。

source: An API key (for OpenAI)
ja_jp: API キー (OpenAI の場合)

source: An Active Community
ja_jp: 活発なコミュニティ

source: An Extension for Long Running Activities
ja_jp: 長時間実行アクティビティのためのエクステンション

source: An HTTP upgrade is secured when a standard security annotation is placed on an endpoint class or an HTTP Security policy is defined. The advantage of securing HTTP upgrade is less processing, the authorization is performed early and only once. You should always prefer HTTP upgrade security unless you need to perform an action on error (see <<secure-callback-methods>>) or a security check based on the payload (see <<secure-endpoints-with-permission-checkers>>).
ja_jp: 標準のセキュリティーアノテーションがエンドポイントクラスに配置されるか、HTTP セキュリティーポリシーが定義されている場合、HTTP アップグレードは保護されます。 HTTP アップグレードをセキュリティーで保護する利点は、処理が少なくなり、認可が早期に 1 回だけ実行されることです。 エラー時にアクションを実行する必要がある場合 (<<secure-callback-methods>> 参照) や、ペイロードに基づいてセキュリティチェックを行う必要がある場合 (<<secure-endpoints-with-permission-checkers>> を参照) を除き、常に HTTP アップグレードセキュリティーを優先する必要があります。

source: An HTTP user agent, for example, a web browser, uses an `Authorization` header to provide a username and password in each HTTP request. The header is specified as `Authorization: Basic <credentials>`, where credentials are the Base64 encoding of the user ID and password joined by a colon, as shown in the following example.
ja_jp: HTTPユーザーエージェント、例えばWebブラウザは、各HTTPリクエストでユーザー名とパスワードを提供するために `Authorization` ヘッダを使用します。このヘッダーは、 `Authorization: Basic <credentials>` として指定されます。ここで、クレデンシャルは、次の例に示すように、ユーザー ID とパスワードをコロンでつないだ Base64 エンコーディングです。

source: An HTTP user agent, like a web browser, uses an `Authorization` header to provide a username and password in each HTTP request. The header is specified as `Authorization: Basic <credentials>`, where credentials are the Base64 encoding of the user ID and password, joined by a colon.
ja_jp: ウェブブラウザのような HTTP ユーザエージェントは、各 HTTP リクエストでユーザ名とパスワードを提供するために `Authorization` ヘッダを使用します。 このヘッダは `Authorization: Basic <credentials>` として指定され、クレデンシャルはコロンで連結されたユーザー ID とパスワードの Base64 エンコーディングです。

source: An HTTP user agent, such as a web browser, uses an `Authorization` header to provide a user name and password in each HTTP request. The header is specified as `Authorization: Basic <credentials>`, where credentials are the Base64 encoding of the user ID and password joined by a colon, as shown in the following example.
ja_jp: WebブラウザのようなHTTPユーザーエージェントは、各HTTPリクエストでユーザー名とパスワードを提供するために、 `Authorization` ヘッダーを使用します。このヘッダーは、 `Authorization: Basic <クレデンシャル>` として指定されます。ここで、クレデンシャルは、次の例に示すように、ユーザー ID とパスワードをコロンでつなげた Base64 エンコーディングです。

source: An IDE
ja_jp: IDE

source: An IDE {prerequisites-ide}
ja_jp: IDE {prerequisites-ide}

source: An OIDC `service` application needs to know the OIDC provider's token, `JsonWebKey` (JWK) set, and possibly `UserInfo` and introspection endpoint addresses.
ja_jp: OIDC `service` アプリケーションは、OIDC プロバイダーのトークン、 `JsonWebKey` (JWK) セット、場合によっては `UserInfo` やイントロスペクションのエンドポイントアドレスを確認する必要があります。

source: An OIDC response filter can be restricted to the specific OIDC endpoint or endpoints with the `quarkus.oidc.common.OidcEndpoint` annotation.
ja_jp: OIDC レスポンスフィルターは、`quarkus.oidc.common.OidcEndpoint` アノテーションを使用して、特定の OIDC エンドポイントまたは複数のエンドポイントに制限できます。

source: An Open Project
ja_jp: オープンプロジェクト

source: An OpenAPI example
ja_jp: OpenAPIの例

source: An Openshift instance
ja_jp: Openshiftインスタンス

source: An Oracle Reactive SQL Client extension
ja_jp: Oracle Reactive SQL Client エクステンション

source: An SBOM (Software Bill of Material) is a manifest that describes what a given software distribution consists of in terms of components. In addition to that, it may include a lot more information such as relationships between those components, licenses, provenance, etc. SBOMs would typically be used by software security and software supply chain risk management tools to perform vulnerability and compliance related analysis.
ja_jp: SBOM (ソフトウェア部品表) は、特定のソフトウェアディストリビューションを構成するコンポーネントを記述したマニフェストです。さらに、コンポーネント間の関係、ライセンス、来歴など、さらに多くの情報が含まれる場合もあります。 SBOM は通常、ソフトウェアセキュリティーおよびソフトウェアサプライチェーンリスク管理ツールが、脆弱性およびコンプライアンス関連の分析を実行するために使用します。

source: An _implementation base_ class using the gRPC API
ja_jp: gRPC APIを利用した _実装のベース_ のクラス

source: An _unremovable_ bean:
ja_jp: _削除できない_ Bean:

source: An _unused_ bean:
ja_jp: _未使用の_Bean:

source: An `@Inject` injection point receives the contextual instance of a CDI bean - the real component under test. An `@InjectMock` injection point receives an "unconfigured" Mockito mock that was created for an <<auto_mocking,unsatisfied dependency automatically>>.
ja_jp: `@Inject` インジェクションポイントは、CDI Bean のコンテキストインスタンス (テスト対象の実際のコンポーネント) を受け取ります。 `@InjectMock` インジェクションポイントは、満たされていない依存関係に対して自動的に作成 (<<auto_mocking,unsatisfied dependency automatically>> を参照) された "未設定" の Mockito モックを受け取ります。

source: An `EntityManagerFactory` will be created based on the Quarkus `datasource` configuration as long as the Hibernate ORM extension is listed among your project dependencies.
ja_jp: Hibernate ORM エクステンションがプロジェクトの依存関係の中に入っていればQuarkus の `datasource` の設定に基づいて `EntityManagerFactory` が作成されます。

source: An `UnsatisfiedResolutionException` indicates a problem during <<cdi.adoc#typesafe_resolution,typesafe resolution>>. Sometimes an injection point cannot be satisfied even if there is a class on the classpath that appears to be eligible for injection. There are several reasons why a class is not recognized and also several ways to fix it. In the first step we should identify the _reason_.
ja_jp: `UnsatisfiedResolutionException` は、 link:cdi.html#typesafe_resolution[タイプセーフ解決] 時に問題があることを示しています。クラスパス上にインジェクションが可能なクラスがあっても、インジェクションポイントを満たすことができないことがあります。クラスが認識されない理由はいくつかありますが、それを解決する方法もいくつかあります。最初のステップでは、その _理由_ を特定する必要があります。

source: An `UnsatisfiedResolutionException` indicates a problem during <<cdi.adoc#typesafe_resolution,typesafe resolution>>. Sometimes an injection point cannot be satisfied even if there is a class on the classpath that appears to be eligible for injection. There are several reasons why a class is not recognized and also several ways to fix it. In the first step, we should identify the _reason_.
ja_jp: `UnsatisfiedResolutionException` は、<<cdi.adoc#typesafe_resolution,タイプセーフな解決>> 中に問題が発生したことを示します。クラスパス上に注入に適しているように見えるクラスがあっても、注入ポイントが満たされない場合があります。クラスが認識されない理由はいくつかあり、それを修正する方法もいくつかあります。最初のステップでは、_理由_ を特定する必要があります。

source: An `UnsatisfiedResolutionException` indicates a problem during xref:cdi.adoc#typesafe_resolution[typesafe resolution]. Sometimes an injection point cannot be satisfied even if there is a class on the classpath that appears to be eligible for injection. There are several reasons why a class is not recognized and also several ways to fix it. In the first step we should identify the _reason_.
ja_jp: `UnsatisfiedResolutionException` は、 xref:cdi.adoc#typesafe_resolution[タイプセーフな解決] 中に問題が発生したことを示しています。クラスパス上に注入可能なクラスがあっても、注入ポイントを満たすことができないことがあります。クラスが認識されない理由はいくつかあり、またそれを解決する方法もいくつかあります。最初のステップでは、その _原因を_ 特定する必要があります。

source: An `application.properties` file must exist (even if empty) in the exact location of the profile-aware (`application-{profile}.properties`) file to be included in the configuration to ensure a consistent order when loading the files.
ja_jp: ファイルを設定に含めて一貫した順序でロードするためには、 `application.properties` ファイルがプロファイル対応ファイル (`application-{profile}.properties`) の正確な場所に (空の場合でも) 存在する必要があります。

source: An `application.yaml` file must exist (even if empty) in the exact location of the profile-aware (`application-{profile}.yaml`) file to be included in the configuration to ensure a consistent order when loading the files. All profile files must match the same extension of the main file.
ja_jp: 設定に含めるには、`application.yaml` ファイルは、ファイルをロードする際の一貫した順序を確保するために、プロファイル対応 (`application-{profile}.yaml`) ファイルの正確な場所に (空の場合でも) 存在する必要があります。すべてのプロファイルファイルは、メインファイルと同じ拡張子と一致している必要があります。

source: An `insert` section may define the default content that is rendered if not overridden. If no name parameter is supplied then the main block of the relevant `{#include}` section is used.
ja_jp: `insert` セクションは、上書きされないとレンダリングされるデフォルトコンテンツを定義することができます。nameパラメータが与えられない場合、関連する `{#include}` セクションのメインブロックが使用されます。

source: An `insert` section may define the default content that is rendered if not overridden. If there is no name supplied then the main block of the relevant `{#include}` section is used.
ja_jp: `insert` セクションは、オーバーライドされない場合にレンダリングされるデフォルトのコンテンツを定義することができます。もし名前が与えられていない場合は、関連する `{#include}` セクションのメインブロックが使用されます。

source: An access token is only required if the endpoint needs to do any of the following:
ja_jp: アクセストークンは、エンドポイントが次のいずれかを実行する必要がある場合にのみ必要です。

source: An access token is only required if the endpoint needs to do the following actions:
ja_jp: アクセストークンは、エンドポイントが次のアクションを実行する必要がある場合にのみ必要です。

source: An additional Quickstart
ja_jp: 追加のクイックスタート

source: An additional step is needed for generating the private key for converting it into the PKCS#8 format.
ja_jp: 秘密鍵を生成して PKCS#8 形式に変換するには、追加の手順が必要です。

source: An additional step is required to generate and convert the private key to the PKCS#8 format, commonly used for secure key storage and transport.
ja_jp: 秘密鍵を生成し、安全なキーの保管と転送に一般的に使用される PKCS#8 形式に変換するには、追加の手順が必要です。

source: An additional string method parameter is used to pass the actual property name.
ja_jp: 追加の文字列メソッドパラメータは、実際のプロパティー名を渡すために使用されます。

source: An additional system property `suspend` can be used to suspend the JVM, when launched in debug mode. `suspend` supports the following values:
ja_jp: 追加のシステム・プロパティー `suspend` は、デバッグ・モードで起動されたときに JVM をサスペンドするために使用できます。 `suspend` は以下の値をサポートしています。
